[
    {
        "title": "About Us",
        "details": "We are a software development and sales company providing and hosting software for financial, insurance, mortgage intermediaries, lenders and insurers. Our business is located at Station Road, Ennis, Co. Clare, Ireland where we may be contacted. Contact details; support@moneyadvice.ie; +353 65 6849675. Our Data Protection Officer may be contacted at dpo@moneyadvice.ie; 065 6849675"
    },
    {
        "title": "Your Information",
        "details": "This is collected from you by our broker customers to whom you provide your personal and financial information. You can also update your information on our systems in an online form when authorised to do so by your broker. The information recorded may include your name, address, e-mail address, phone number, personal description and financial or other business information, employment information (current and past) and may include family information. Health information may be provided if applying for protection insurance, pension, or a mortgage."
    },
    {
        "title": "Use of Information",
        "details": "We never share or process personal information. In the course of our business with our clients and acting on their instructions we may use your information in the performance of our contract, account set up, delivering our technical and customer support including account management, and investigating complaints. We may exceptionally share personal information in the following circumstances;",
        "policyBulletPoints": ["When required to do so by legal or court demands", "When required to report to Government Bodies", "If requested and properly authorised to do so by a broker client", "If required to do so to assist with a data subject request from a broker’s customer", "If necessary, to provide technical support or investigate a data breach", "To ensure the security of our systems and networks", "If necessary, to improve our products and services", "If necessary, to monitor users' abuse on our systems", "For the purposes of fraud protection/prevention", "For systems or financial audit purposes", "Your broker will of course share your information with lenders, insurers, and others to provide services to you", "If required, please clarify this with your broker through your financial advisor or the firm’s privacy statement"]
    },
    {
        "title": "Communication",
        "details": "We do not envisage communicating with broker customers on our platform except in the following circumstances: - Where we are instructed to do so by our broker client - Where we are required to do so by law, court order or in the public interest. - If instructed to do so by a Public Body, duly authorised. - Where a broker customer requires us to do so for legitimate reasons and the broker is not available to instruct us in the matter. - Where legitimate circumstances exist. - If we are required to fulfil contractual commitments. - If we sell or buy any business or assets, in which case we may disclose your personal information to the prospective seller or buyer of such business or assets. - We contract with a third-party processor, contractor, or subcontractor to process personal information on our behalf in relation to the delivery of our services to brokers."
    },
    {
        "title": "Cookies",
        "details": "Lunar Technologies does not use cookies to store other confidential user and session information, but instead implements more advanced security methods based on dynamic data and encoded session IDs."
    },
    {
        "title": "Informatiion Security",
        "details": "Money Advice utilises some of the most advanced technology for internet security available today. The system uses a code-signing certificate to ensure you are accessing a registered and secure application. When users access our site using industry standard Secure Socket Layer (SSL) technology, your information is protected using both server authentication and data encryption, ensuring that data is safe, secure, and available only to registered Users in your organisation. Individual broker customer data is completely inaccessible except to users authorised by the individual broker. Money Advice provides each user with a unique user name password and PIN (number) that must be entered each time a User logs on. These details are stored in an encrypted fashion in the database and can only be validated using a valid key. LT issues a session cookie only to record encrypted authentication information for the duration of a specific session. The session cookie does not include either the username or password of the user. In addition, Lt is hosted in a secure server environment, within the EU, that uses a firewall and other advanced technology to prevent interference or access from outside intruders."
    },
    {
        "title": "Where Does Your Data Reside?",
        "details": "Money Advice application and database are hosted on servers in a data centre operated by Dimension Data (www.dimensiondata.com) in the UK. Dimension Data are a SAS AE 16 compliant company. Our contract with Dimension Data is for a “managed hosting” service – this means that Dimension Data have full responsibility for security and maintenance of the hardware. Dimension Data offers a combination of dynamic security solutions which enable us to proactively maintain defensible networks. Our layered approach to addressing these complex issues is to employ a defence-in-depth strategy, which means no one solution is solely relied upon. The Dimension Data IDS solution provides defence in depth by analysing network traffic and either blocking, replacing or alerting when suspicious activity is detected. The system utilises a rules-based language, which combines the benefits of signature, protocol and anomaly-based inspection methods. Rules are used to examine packets at both the IP protocol level and at the application level and can be set to look for specific occurrences of attacks against a protocol or set to look for the conditions of an attack. Dimension Data has selected a Tier 1 Managed Security Services Provider (MSSP) to monitor its intrusion detection system (IDS). The MSSP complements Dimension Data's existing inhouse capabilities and technologies with around-the-clock analysis, expertise and processes. This enables Dimension Data to measure the effectiveness and efficiency of its security controls, ensure business operations are not disrupted by threats and comply with legislation and reduce organizational risk."
    },
    {
        "title": "Customer Rights",
        "details": "If brokers process personal information based upon consent to do so, that consent may be withdrawn at any time by their customer. Broker customers may object to processing of personal information where processing is based upon our legitimate interests. Where required under applicable law, brokers should stop any such processing and notify their customer if that changes."
    },
    {
        "title": "Profiling",
        "details": "If a decision affecting a broker customer was based solely upon the automated processing of personal information, including profiling, and that decision produces a legal effect for the customer or similarly significantly affects the customer , they may have the right to contest that decision and ask for human review by the broker."
    },
    {
        "title": "Customer Data Requests",
        "details": "Broker customers may request disclosure of certain details regarding the processing of personal information, or that it be corrected, amended, deleted, or restricted in processing or may be requested to provide to customers, details of the personal information held. Where required under applicable law, brokers will notify any third-party recipients of this, where possible. Please note, though, that requests are subject to any applicable legal and ethical reporting or data retention obligations imposed on brokers. Upon receipt of a written request and enough information to permit brokers to identify the relevant personal information, brokers should respond to such requests without undue delay. If a delay is necessary, where permitted by applicable law, brokers will notify customers of this, together with the reasons for the delay. If they are unable to act on the request, they will, as required by applicable law, annotate the personal information under their control with a note that action was requested but not made. In this event, they will notify customers without undue delay of the reasons for not taking action, and customers have the right to lodge a complaint with the relevant supervisory authority and ability to seek to enforce their rights through a judicial remedy. Brokers may charge a reasonable fee, where allowed by applicable law, based on any unusual administrative costs in complying with customer requests; for instance, where further copies of the information held are requested, or where requests are unfounded or excessive.Customers may exercise these or any other rights available to them under applicable law by emailing their broker with any specific request, or by otherwise contacting them."
    },
    {
        "title": "Data Retention",
        "details": "Brokers are governed by GDPR and in their day to day activity by Central Bank of Ireland procedures. Generally, customers data is retained for 6 years after cessation of a customers’ relationship with a broker. In the event of a declined application this may be for a period of one year, subject to the application of the laws in such matters."
    }
]