[
    {
        "overviewTitle": "Overview",
        "overviewMainImage": "http://moneyadvice.ie/images/tab-img1.jpg",
        "overviewMainDescription": "Money Advice +CRM and Money Advice are web-based software packages developed to provide Financial Advisors, Financial Planners, Mortgage Advisors, and Finance Consultants, with comprehensive quotations and CRM platforms to empower them to compliantly provide in-depth, quality advice and on-going services to their clients. Money Advice +CRM is our enterprise version of the software and Money Advice is a limited edition. Product features of each are listed here. In building software solutions for our advisor customers we have also committed to providing full support across all financial services, mortgage and broker lending products and to integrate with the other systems and providers where we can improve on services to our clients. Our objective is to provide substantial saving in administration time, compliance management, and creation of revenue opportunities for advisors though marketing capabilities. We provide online links to providers in the areas of life protection products, wealth management, pensions, mortgages, and personal lines general insurance. We firmly believe in supporting our customers and provide dedicated support and on-site training to new clients while getting established with our software. Training and Helpdesk supports are available to all customers on an on-going basis. Existing client banks and customer information can be imported into the system. Quotations, research reports, fact finds, compliance questionnaires, portfolio reports, client risk profile reports and needs analysis reports are printed on designed forms with the advisors branding prominent. All reports are graphically aligned to the fact find reports to provide comprehensive client presentations in an attractive format. Fact find reports are automatically updated from insurer data downloads. Money Advice systems are linked to MoneyMate's new platform Fund Focus providing fund information and performance data on more than 850 investment funds with supporting fact sheets where available. Customers of Money Advice systems, can upload client model portfolios directly into Fund Focus where users can analyse the portfolio's overall risk and performance. Our Financial Planning module incorporates full client needs analysis, client portfolio details, client assets and liabilities graphically displayed, and cash flow charts with future needs mapped showing calculations. Mortgage Advisors can avail of the quotations system with up-to-date mortgage rates from MoneyMate. A new data capture facility has been created specifically to deal with mortgage enquiries which asks the relevant questions to establish affordability and qualify the lead. The affordability calculators of Haven, KBC, Permanent TSB have been integrated so that the advisor can check the affordability against each lender or all of them at once. These enquiries can also be converted and submitted as Online applications to Haven Mortgages Limited (AIB Group). For the lenders who do not provide online services we have provided a generic mortgage application section, which has all the information fields required by any lender. Additionally the system provides the following mortgage related calculators : Repayment (monthly, interest only, and bi-weekly), Stamp duty, Loan consolidation, Extra monthly payment and/or lump sum, Mortgage comparison (different rates, terms, amounts)",
        "overviewSubtitle": "Needs Analysis and Financial Planning Calculators are designed to provide financial planning in the areas of:",
        "overviewBulletPoints": [
            "Life cover",
            "Specified illness",
            "Mortgage protection",
            "Income protection",
            "Inheritance tax planning",
            "Pensions including ARF / AMRF's",
            "Savings and lump sum investment",
            "Borrowings and other commitments",
            "Cash flow projections"
        ],
        "overviewSecondaryParagraph": "Compliance tools (CPC 2012) are a strong feature of the system with helpful checklists and prompts. The system produces compliance reports on a product, advisor, and office wide basis. The product library is a powerful resource in the system and includes links to insurer's libraries and also PDF's of actual documents. Having access to a web based system allows access to client files and systems from anywhere with an internet connection, enabling users track sales activity at an office, individual or a team level.",
        "overviewTable": ["Comprehensive management reporting",
        "Compliance management suite incorporating checklists & prompts",
        "Compliance document templates",
        "Comprehensive product library",
        "Pipeline recording",
        "Underwriting tracking",
        "Document management",
        "Marketing tool suite including mail, text messaging and e-mail merges",
        "Commission, fee tracking, reconciliation and reporting",
        "Lead generation",
        "Branding facility for documents",
        "Text messaging, E-mail tracking against client",
        "Mortgage quotations calculator (all lenders)"]
    }
]