[
    {
        "id": 1,
        "first_name": "Heber",
        "sur_name": "O'Farrell",
        "profile_picture": "https://i.imgur.com/mVSTC4J.jpg",
        "company_name": "FinanceOne",
        "company_logo": "https://i.imgur.com/UrJGKUz.jpg",
        "testimonial": "While never easy to satisfy the needs of a retail financial services provider, Philip has brought his own experience as a Financial Services Broker and built a robust CRM system which enables us to meet our needs in terms of compliance, sales and ongoing servicing of our customers. With the back-up and expertise of a consistent and committed team, he has continuously improved and invested in 'Money Advice' and the fruits of this are there to be seen."
    },
    {
        "id": 2,
        "first_name": "Barry",
        "sur_name": "Fitzsimons",
        "profile_picture": "https://i.imgur.com/uTUsPdU.jpg",
        "company_name": "Fitzsimons Finance",
        "company_logo": "https://i.imgur.com/znyA4Pq.jpg",
        "testimonial": "We’ve been a user of Broker CRM since 2004. We moved to Money Advice +CRM in 2015 & did so with great ease & efficiency. We’re delighted to have a system that delivers exactly what we want in a 'one fit' software solution for both financial planning & mortgages."
    },   
    {
        "id": 3,
        "first_name": "Valerie",
        "sur_name": "Deasy",
        "profile_picture": "https://i.imgur.com/VN9JaSb.jpg",
        "company_name": "Alliance Insurance",
        "company_logo": "https://i.imgur.com/061esVL.jpg",
        "testimonial": "Being an experienced user of CRM systems, Money Advice staff made it an easy transition for us to Money Advice +CRM in 2013. The Money Advice team facilitated the transfer of information and we had the added benefit of data feed updates from all the companies on Money Advice; the current policy information is of enormous benefit to both the administration team and especially the sales consultants. The system is innovative, practical and user friendly. As with all new systems, it takes avid use to get the most from the software. It has an enormous compliment of well thought out features which has improved our sales and compliance processes. From a management point of view, the reporting facilities are second to none.Philip and his support and development team are a pleasure to work with and their quick responsive support to queries or technical support requests commendable. With constant ongoing development, this industry driven software is forever evolving and improving and we look forward to continuing to grow our business with this system as the back bone to our productivity.",
        "viewMoreButton": "view more"
    },
    {
        "id": 4,
        "first_name": "Eoin",
        "sur_name": "Doohan",
        "profile_picture": "https://i.imgur.com/l1f6HDM.jpg",
        "company_name": "DFP Consultants",
        "company_logo": "https://i.imgur.com/hIuESVQ.jpg",
        "testimonial": "DFP Pension & Investment Consultants have been customers of Money Advice since 2012 and have found the staff and system to be of the very highest quality. The reason I initially chose Broker CRM, as it was called then, had nothing to do with my understanding of CRM systems but that I was impressed with Philip’s passion for the system and I knew him when I was a young fella in Ennis. I still don’t know much about CRM but I’m sure glad DFP partnered with Money Advice in 2012."
    },
    {
        "id": 5,
        "first_name": "Bill",
        "sur_name": "Coyne",
        "profile_picture": "https://i.imgur.com/M4HJ5eI.jpg",
        "company_name": "Lifepath",
        "company_logo": "https://i.imgur.com/ZHVujVB.jpg",
        "testimonial": "I've been a client on Moneyadvice for over a year, having been a customer of Broker CRM since 2006, and have found the new system to be quicker and easier to use than the old one. Updates are continually added and the system meets all the needs of my firm. Staff and service are of a high level and I continue to recommend this system to any advisors that I meet."
    }
]